Repository: amyhuang13506-svg/LangPod
Catalog: LangPod/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, pt_br, zh_hant

source: 删除
en: Delete
es: Eliminar
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hant: 刪除

source: 刷懂英文原声视频
en: Understand English Videos
es: Entender videos en inglés nativo
ja: 英語の音声動画を理解
ko: 영어 원어 영상 이해하기
pt_br: Entender vídeos originais em inglês
zh_hant: 刷懂英文原聲影片

source: 剩余 %@
en: Remaining %@
es: Quedan %@
ja: 残り%@@
ko: 남은 %@
pt_br: Restante %@
zh_hant: 剩餘 %@

source: 办事、就医、社交都能自己搞定，不用再靠翻译软件
en: Handle Tasks, Medical Visits & Socials Without Translation Apps
es: Resuelve trámites, citas médicas y reuniones sin traductores
ja: 手続き、病院、社交を自分でこなせる、翻訳ソフト不要
ko: 일 처리·진료·사회적 교류, 번역 앱 필요 없음
pt_br: Resolver assuntos, consultas e socialização sem depender de tradutor
zh_hant: 辦事、就醫、社交都能自己搞定，不用再靠翻譯軟體

source: 加入单词本
en: Add to Wordbook
es: Añadir al vocabulario
ja: 単語リストに追加
ko: 단어장에 추가
pt_br: Adicionar ao vocabulário
zh_hant: 加入單詞本

source: 加入生词本
en: Add to Wordbook
es: Añadir al vocabulario
ja: 単語帳に追加
ko: 단어장에 추가
pt_br: Adicionar ao vocabulário
zh_hant: 加入生字本

source: 加拿大
en: Canada
es: Canadá
ja: カナダ
ko: 캐나다
pt_br: Canadá

source: 加载中…
en: Loading…
es: Cargando…
ja: 読み込み中…
ko: 로딩 중…
pt_br: Carregando…
zh_hant: 載入中…

source: 加载失败，请检查网络
en: Load Failed, Please Check Network
es: Error de carga, verifica tu conexión
ja: ロード失敗しました。ネットワークを確認してください
ko: 불러오기에 실패했습니다. 네트워크를 확인하세요.
pt_br: Falha no carregamento, verifique a rede
zh_hant: 加載失敗，請檢查網路

source: 升Lv.%lld
en: Level Up to Lv.%lld
es: Sube a nivel %lld
ja: レベル%lldへアップ
ko: Lv.%lld로 상승
pt_br: Subir para Lv.%lld

source: 升级 Pro
en: Upgrade to Pro
es: Actualizar a Pro
ja: Proにアップグレード
ko: Pro로 업그레이드
pt_br: Upgrade Pro
zh_hant: 升級 Pro

source: 升级 Pro 继续练习
en: Upgrade to Pro to Continue
es: Actualiza a Pro para continuar
ja: Proにアップグレードして続けましょう
ko: Pro로 업그레이드하여 계속 연습하기
pt_br: Atualize para Pro para continuar
zh_hant: 升級 Pro 繼續練習

source: 单集循环
en: Single Episode Loop
es: Repetir episodio
ja: 単一ループ
ko: 단일 에피소드 반복
pt_br: Repetir único
zh_hant: 單集循環

source: 即将播放
en: Up Next
es: Próximo
ja: まもなく再生
ko: 곧 재생
pt_br: Próximo
zh_hant: 即將播放

source: 即将清零！还有 %lldh
en: Resetting Soon! %lldh Left
es: ¡Pronto en cero! Falta %lldh
ja: もうすぐゼロ！あと%lld時間
ko: 곧 초기화! %lld시간 남음
pt_br: Prestes a zerar! Restam %lldh
zh_hant: 即將清零！還有 %lldh

source: 原声 · 演讲
en: Raw · Speech
es: Nativo · discurso
ja: ネイティブ·演講
ko: 원어민 · 강연
pt_br: Nativo · Palestras
zh_hant: 原聲 · 演講

source: 去听一集
en: Listen to a Podcast
es: Escuchar un pódcast
ja: 1話聞く
ko: 팟캐스트 듣기
pt_br: Ir ouvir
zh_hant: 去聽一集

source: 去完成
en: Complete Now
es: Completelo
ja: 完了する
ko: 가서 완료하기
pt_br: Conclua

source: 双人深度对话系列
en: Dual Deep Dialogue Series
es: Serie de diálogo profundo entre dos
ja: 二人の深い対話シリーズ
ko: 2인 심층 대화 시리즈
pt_br: Série de diálogos profundos
zh_hant: 雙人深度對話系列

source: 双语字幕 · 点词查询
en: Bilingual Subtitles · Tap to Lookup
es: Subtítulos bilingües · Consulta de palabras
ja: 二言語字幕 · 単語タップ検索
ko: 영한 자막 · 단어 검색
pt_br: Legendas bilíngues · Consulta de palavras
zh_hant: 雙語字幕 · 點字查詢

source: 取消
en: Cancel
es: Cancelar
ja: キャンセル
ko: 취소
pt_br: Cancelar

source: 句型
en: Pattern
es: Patrón
ja: 文型
ko: 문형
pt_br: Padrão

source: 句型上口
en: Pattern Sticks
es: Patrones al habla
ja: 文型が自然に出る
ko: 문형이 입에 붙다
pt_br: Padrões na ponta da língua

source: 句型讲解
en: Pattern Explainer
es: Explicación del patrón
ja: 文型解説
ko: 문형 해설
pt_br: Explicação do padrão
zh_hant: 句型講解

source: 可以试试 演讲者、单词、句型、级别（初级/中级/高级）
en: Try Speaker, Words, Pattern, Level (Beginner/Intermediate/Advanced)
es: Prueba con autor, palabras, patrón, nivel (principiante/intermedio/avanzado)
ja: スピーカー、単語、文型、レベル（初級／中級／上級）を試すことができます
ko: 연설자, 단어, 문형, 수준(초급/중급/고급) 등을 시도해보세요
pt_br: Experimente palestrante, palavras, padrão, nível (iniciante/intermediário/avançado)
zh_hant: 可以試試 演講者、單字、句型、級別（初級/中級/高級）

source: 可在 App Store 设置中随时取消
en: Cancel Anytime in App Store Settings
es: Puedes cancelar en la configuración de App Store
ja: App Store の設定でいつでもキャンセル
ko: App Store 설정에서 언제든 취소 가능
pt_br: Cancele a qualquer momento nas configurações da App Store
zh_hant: 可在 App Store 設定中隨時取消

source: 听 5 分钟真实播客
en: Listen to 5-Minute Raw Podcast
es: Escuchar 5 minutos de pódcast nativo
ja: 5分間のネイティブポッドキャストを聴く
ko: 5분 원어민 팟캐스트 듣기
pt_br: Ouvir 5 min de podcast nativo
zh_hant: 聽 5 分鐘真實 Podcast

source: 听一个句型讲解
en: Listen to a Pattern Explainer
es: Escuchar una explicación del patrón
ja: 文型解説を1回聴く
ko: 문형 해설 듣기
pt_br: Ouvir explicação do padrão
zh_hant: 聽一個句型講解

source: 听一集学习播客
en: Listen to a Learning Podcast
es: Escuchar un pódcast educativo
ja: ポッドキャストを1エピソード聴く
ko: 학습 팟캐스트 1회 듣기
pt_br: Ouvir um podcast de aprendizado
zh_hant: 聽一集學習 Podcast

source: 听一集播客，词汇会自动收藏到这里
en: Listen to a Podcast to Collect Words Here
es: Escucha un pódcast y el vocabulario se guardará aquí
ja: ポッドキャストを1話聞いて語彙を自動保存
ko: 팟캐스트를 들으면 단어가 여기에 자동 저장됩니다
pt_br: Ouça um podcast, vocabulário é salvo aqui
zh_hant: 聽一集 Podcast，單字會自動收藏到這裡

source: 听懂
en: Understand
es: Entender
ja: 聞いて理解
ko: 들음
pt_br: Entender
zh_hant: 聽懂

source: 周
en: Week
es: semana
ja: 週
ko: 주
pt_br: semanas
zh_hant: 週

source: 商务英语
en: Business English
es: Inglés de negocios
ja: ビジネス英語
ko: 비즈니스 영어
pt_br: Inglês comercial
zh_hant: 商務英語

source: 商品未加载，请稍后重试。
en: Product not loaded. Please try again later.
es: Producto no cargado, intenta más tarde.
ja: 商品が読み込まれていません。後ほど再試行してください。
ko: 상품 로드 실패. 잠시 후 다시 시도하세요.
pt_br: Produto não carregado, tente novamente mais tarde.
zh_hant: 商品未加載，請稍後重試。

source: 在句型和小课堂里点 ＋ 收藏句子 （句子需 ≤12 个单词）
en: Tap ＋ in Patterns or Vocab Lessons to Save Sentences (Sentences ≤12 Words)
es: En patrón y mini clase toca ＋ para guardar frases (frases con ≤12 palabras)
ja: 文型と語彙レッスンで＋を押して文を収集 (文は12単語以内)
ko: 문형과 어휘 클래스에서 ＋ 클릭해 문장 저장 (12단어 이하 문장)
pt_br: Nos padrões e na miniaula, clique ＋ para favoritar frases (frases com ≤12 palavras)
zh_hant: 在句型和小課堂裡點 ＋ 收藏句子 （句子需 ≤12 個單字）

source: 在句型详情和小课堂的常用句型里 点 ＋ 把句子收进来
en: Tap ＋ in Pattern Details and Vocab Lesson to Add Sentences
es: En detalles de patrón y mini clase toca ＋ para guardar frases
ja: 文型の詳細や語彙レッスンの よく使う文型で＋を押して文を収集
ko: 문형 상세와 어휘 클래스에서 ＋를 눌러 문장을 추가하세요.
pt_br: Nos detalhes de padrão e na miniaula de vocabulário clique ＋ para adicionar frases
zh_hant: 在句型詳情和小課堂的常用句型裡 點 ＋ 把句子收進來

source: 在国外生活
en: Living Abroad
es: Vida en el extranjero
ja: 海外生活
ko: 해외 생활
pt_br: Vida no exterior
zh_hant: 在國外生活

source: 场景与感觉
en: Scene and Feeling
es: Escena y sensación
ja: シーンと雰囲気
ko: 상황과 느낌
pt_br: Cena e sensação
zh_hant: 場景與感覺

source: 场景对话准备中
en: Preparing Scene Dialogue
es: Preparando diálogo de escena
ja: シーン対話準備中
ko: 상황 대화 준비 중
pt_br: Preparando diálogo de cena
zh_hant: 場景對話準備中

source: 场景模拟
en: Scene Simulation
es: Simulación de escena
ja: シーン模擬
ko: 상황 시뮬레이션
pt_br: Simulação de cena
zh_hant: 場景模擬

source: 场景模拟一轮
en: Scene Simulation Round
es: Una ronda de escena simulada
ja: シーンシミュレーション1ラウンド
ko: 상황 시뮬레이터 1회
pt_br: Uma rodada de cenário
zh_hant: 場景模擬一輪

source: 场景通关！
en: Scene Cleared!
es: ¡Escena completada!
ja: シーンクリア！
ko: 상황 클리어!
pt_br: Cena concluída!
zh_hant: 場景通關！

source: 坚持一整年，流利说英语
en: Fluent English in a Year
es: Un año completo, inglés fluido
ja: 1年続けて英語を流暢に
ko: 1년 지속, 영어 유창해져요
pt_br: Pratique por um ano, fale inglês fluentemente
zh_hant: 堅持一整年，流利說英語

source: 坚持下去，你会听到变化
en: Keep Going, You'll Hear Change
es: Sigue adelante, lo notarás
ja: 続けると変化が聞こえます
ko: 계속하면 변화를 들을 수 있어요
pt_br: Continue firme, você ouvirá mudanças
zh_hant: 堅持下去，你會聽到變化

source: 复习中
en: Reviewing
es: Repasando
ja: 復習中
ko: 복습 중
pt_br: Revisando
zh_hant: 複習中

source: 天
en: Days
es: días
ja: 日
ko: 일
pt_br: dias

source: 好
en: OK
es: Vale
ja: OK
ko: 좋아요
pt_br: Ok

source: 好，提醒我
en: Yes, Remind Me
es: Sí, avísame
ja: はい、お願いします
ko: 네, 알림 설정
pt_br: Sim, me avise

source: 娱乐 · 文化
en: Entertainment · Culture
es: Entretenimiento · Cultura
ja: エンタメ · 文化
ko: 엔터테인먼트 · 문화
pt_br: Entretenimento · Cultura
zh_hant: 娛樂 · 文化

source: 字幕
en: Subtitles
es: Subtítulos
ko: 자막
pt_br: Legendas

source: 字幕加载中…
en: Loading Subtitles…
es: Cargando subtítulos…
ja: 字幕読み込み中…
ko: 자막 로드 중…
pt_br: Carregando legendas...
zh_hant: 字幕加載中…

source: 字面意思
en: Literal Meaning
es: Significado literal
ja: 直訳
ko: 직역
pt_br: Significado literal

source: 学一个句型
en: Learn a Pattern
es: Aprender un patrón
ja: 文型を1つ学ぶ
ko: 문형 배우기
pt_br: Aprender um padrão
zh_hant: 學一個句型

source: 学一篇词汇小课堂
en: Learn a Vocab Lesson
es: Aprender una mini clase de vocabulario
ja: 語彙レッスンを1回学ぶ
ko: 어휘 클래스 배우기
pt_br: Uma miniaula de vocabulário
zh_hant: 學一篇單字小課堂

source: 学习
en: Learn
es: Aprender
ja: 学習
ko: 학습
pt_br: Estudar
zh_hant: 學習

source: 学习时长
en: Study Duration
es: Duración de estudio
ja: 学習時間
ko: 학습 시간
pt_br: Tempo de estudo
zh_hant: 學習時長

source: 完成
en: Done
es: Completar
ja: 完了
ko: 완료
pt_br: Concluir

source: 完成 %lld 个词的连词成句练习
en: Completed Sentence Builder with %lld Words
es: Ordenaste %lld palabras
ja: %lld個の単語の並べ替え完了
ko: %lld개의 단어로 문장 만들기 완료
pt_br: Complete a prática de montar %lld frases
zh_hant: 完成 %lld 個詞的連詞成句練習

source: 完成 %lld 句连词成句练习
en: Completed %lld Sentence Builder Exercises
es: Completa %lld prácticas de ordenar la frase
ja: %lld文の並べ替え練習完了
ko: %lld 문장 문장 만들기 연습 완료
pt_br: Complete %lld exercícios de Montar a frase
zh_hant: 完成 %lld 句連詞成句練習

source: 完美一天！
en: Perfect Day!
es: ¡Día perfecto!
ja: 完璧な一日！
ko: 완벽한 하루!
pt_br: Dia perfeito!

source: 完美一天！%lld 个任务全部完成
en: Perfect Day! All %lld Tasks Completed
es: ¡Día perfecto! %lld tareas completadas
ja: 完璧な一日！%lld個のタスク完了
ko: 완벽한 하루! %lld개 임무 모두 완료
pt_br: Dia perfeito! %lld tarefas concluídas
zh_hant: 完美一天！%lld 個任務全部完成

source: 定时播放
en: Timed Playback
es: Reproducción programada
ja: タイマー再生
ko: 타이머 재생
pt_br: Reprodução programada
zh_hant: 定時播放

source: 实用口语
en: Practical English
es: Conversación práctica
ja: 実用会話
ko: 실용 회화
pt_br: Conversação prática
zh_hant: 實用口語

source: 对话完成！
en: Conversation Complete!
es: ¡Diálogo completo!
ja: 会話完了！
ko: 대화 완료!
pt_br: Conversa concluída!
zh_hant: 對話完成！

source: 将 %lld 个已掌握的词移出词汇本。这些词你已经学会了！
en: Remove %lld Mastered Words from Vocabulary List. You've Learned Them!
es: Quitar %lld palabras dominadas del vocabulario. ¡Ya las aprendiste!
ja: %lld個のマスター済み単語を移動。これらの単語はもう学んだ！
ko: 마스터한 %lld개의 단어를 단어장에서 제거합니다. 이 단어들은 이미 배웠어요!
pt_br: Remover %lld palavras dominadas. Você já aprendeu!
zh_hant: 將 %lld 個已掌握的單字移出單字本。這些單字你已經學會了！

source: 小红书
en: Xiaohongshu
es: Xiaohongshu
ja: Xiaohongshu
ko: 샤오홍슈
pt_br: Xiaohongshu
zh_hant: 小紅書

source: 少而稳定比多而三天打鱼更有效
en: Less But Steady Beats More But Sporadic
es: Mejor poco y constante que mucho e inconstante
ja: 少しずつ安定学習が効果的
ko: 적게 꾸준히 하는 게 더 많이 하다 흐지부지하는 것보다 효과적이에요
pt_br: Pouco e consistente é melhor que muito e esporádico
zh_hant: 少而穩定比多而三天打魚更有效

source: 工作需要
en: Work Needs
es: Por trabajo
ja: 仕事で必要
ko: 업무 필요
pt_br: Necessidade de trabalho

source: 差%lld集
en: %lld Episodes Left
es: Faltan %lld episodios
ja: あと%lld話
ko: %lld개 남음
pt_br: %lld cenas restantes

source: 已保存 %lld 个新词 · 即将播放下一集
en: %lld New Words Saved · Next Episode Playing Soon
es: Guardadas %lld nuevas palabras · Reproduciendo siguiente episodio
ja: %lld語の新単語を保存済み · 次のエピソードを再生
ko: %lld개의 새 단어 저장됨 · 다음 회차 재생 대기 중
pt_br: %lld novas palavras salvas · Próximo episódio em breve
zh_hant: 已保存 %lld 個新單字 · 即將播放下一集

source: 已保存到相册
en: Saved to Album
es: Guardado en el álbum
ja: アルバムに保存済み
ko: 앨범에 저장됨
pt_br: Salvo no álbum
zh_hant: 已保存到相簿

source: 已全部加入 ✓
en: All Added ✓
es: Todo añadido ✓
ja: 全て追加済み ✓
ko: 모두 추가됨 ✓
pt_br: Tudo adicionado ✓

source: 已加入 %lld 个新词
en: Added %lld New Words
es: %lld nuevas palabras añadidas
ja: %lld個の新しい単語が追加されました
ko: %lld개 새 단어 추가됨
pt_br: %lld novas palavras adicionadas
zh_hant: 已加入 %lld 個新單字

source: 已加入句型库
en: Added to Pattern Library
es: Añadido al banco de patrones
ja: 文型コレクションに追加済み
ko: 문형에 추가됨
pt_br: Adicionado ao padrão
zh_hant: 已加入句型庫

source: 已加入我的单词 ✓
en: Added to My Words ✓
es: Añadido a mis palabras ✓
ja: 私の単語に追加済み ✓
ko: 내 단어에 추가됨 ✓
pt_br: Palavra adicionada ✓
zh_hant: 已加入我的單詞 ✓

source: 已听到 %lld 次
en: Heard %lld Times
es: Escuchado %lld veces
ja: %lld 回聞いた
ko: %lld번 들음
pt_br: Ouvido %lld vezes
zh_hant: 已聽到 %lld 次

source: 已完成
en: Completed
es: Completado
ja: 完了
ko: 완료됨
pt_br: Concluído

source: 已完成：%@
en: Completed: %@
es: Completado: %@
ja: 完了：%@
ko: 완료됨: %@
pt_br: Concluído: %@

source: 已完成：%@ · 下一个：%@
en: Completed: %@ · Next: %@
es: Completado: %@ · Siguiente: %@
ja: 完了：%@ · 次：%@
ko: 완료됨: %@ · 다음: %@
pt_br: Concluído: %@ · Próximo: %@
zh_hant: 已完成：%@ · 下一個：%@

source: 已掌握
en: Mastered
es: Dominadas
ja: マスター済み
ko: 마스터함
pt_br: Dominadas

source: 已清零
en: Reset Done
es: Vacío
ja: リセット済み
ko: 초기화됨
pt_br: Zerado

source: 已满级
en: Max Level
es: Nivel máximo
ja: 最高レベル到達
ko: 최고 레벨
pt_br: Nível máximo
zh_hant: 已滿級

source: 已订阅 Pro
en: Subscribed to Pro
es: Ya suscrito a Pro
ja: Proを購読済み
ko: Pro 구독 중
pt_br: Assinado Pro
zh_hant: 已訂閱 Pro

source: 年
en: Year
es: año
ko: 년
pt_br: anos

source: 年付
en: Annual Payment
es: Pago anual
ja: 年額
ko: 연 결제
pt_br: Anual

source: 开启我的计划
en: Start My Plan
es: Iniciar mi plan
ja: 計画を開始する
ko: 계획 시작하기
pt_br: Iniciar meu plano
zh_hant: 開啟我的計畫

source: 开始免费试用
en: Start Free Trial
es: Inicia prueba gratuita
ja: 無料試用を開始
ko: 무료 체험 시작
pt_br: Iniciar teste grátis
zh_hant: 開始免費試用

source: 开始定制
en: Start Customization
es: Comenzar
ja: カスタマイズ開始
ko: 맞춤 시작
pt_br: Começar customização
zh_hant: 開始定制

source: 开始对话
en: Start Conversation
es: Iniciar diálogo
ja: 会話を始める
ko: 대화 시작
pt_br: Iniciar conversa
zh_hant: 開始對話

source: 当前级别
en: Current Level
es: Nivel actual
ja: 現在のレベル
ko: 현재 레벨
pt_br: Nível atual
zh_hant: 當前級別

source: 往期句型回顾
en: Past Pattern Review
es: Repaso de patrones anteriores
ja: 過去の文型を振り返る
ko: 지난 문형 복습
pt_br: Revisão de padrões anteriores
zh_hant: 往期句型回顧

source: 往期回顾
en: Past Review
es: Revisión anterior
ja: 過去の回顧
ko: 이전 회고
pt_br: Revisão anterior
zh_hant: 往期回顧

source: 微信
en: WeChat
es: WeChat
ja: WeChat
ko: 웨이신
pt_br: WeChat

source: 思想 · 访谈
en: Thoughts · Interviews
es: Ideas · Entrevistas
ja: 考え · インタビュー
ko: 생각 · 인터뷰
pt_br: Ideias · Entrevistas
zh_hant: 思想 · 訪談

source: 恢复购买
en: Restore Purchase
es: Restaurar compra
ja: 購入を復元
ko: 구매 복원
pt_br: Restaurar compra
zh_hant: 恢復購買

source: 恭喜升级！
en: Congratulations on Leveling Up!
es: ¡Felicitaciones por subir de nivel!
ja: アップグレードおめでとう！
ko: 업그레이드 축하해요!
pt_br: Parabéns pela atualização!
zh_hant: 恭喜升級！

source: 成就徽章
en: Achievement Badge
es: Insignia de logros
ja: 達成バッジ
ko: 업적 배지
pt_br: Emblema de conquistas

source: 我们会按你的目标安排学习内容
en: We'll Tailor Content to Your Goals
es: Personalizaremos tu contenido de aprendizaje
ja: 目標に合わせて学習内容を設定します
ko: 목표에 맞춰 학습 내용을 준비할게요
pt_br: Organizamos o conteúdo de acordo com seus objetivos
zh_hant: 我們會按你的目標安排學習內容

source: 我的
en: Profile
es: Perfil
ja: プロフィール
ko: 프로필
pt_br: Perfil

source: 我的句子
en: My Sentences
es: Mis frases
ja: 私の文
ko: 내 문장
pt_br: Minhas frases

source: 我的学习计划
en: My Learning Plan
es: Mi plan de estudio
ja: 私の学習計画
ko: 내 학습 계획
pt_br: Meu plano de estudos
zh_hant: 我的學習計畫

source: 我的词汇
en: My Vocabulary
es: Mis palabras
ja: 私の語彙
ko: 내 단어
pt_br: Meu vocabulário
zh_hant: 我的單字

source: 所有词汇都练过了
en: All Words Practiced
es: Todo el vocabulario practicado
ja: 全ての語彙を練習済み
ko: 모든 단어를 연습했습니다
pt_br: Todas as palavras praticadas
zh_hant: 所有單字都練過了

source: 打开 Castlingo，继续你的听力训练
en: Open Castlingo and Continue Listening Practice
es: Abre Castlingo, sigue entrenando tu escucha
ja: Castlingoを開いて、リスニングを続けましょう
ko: Castlingo를 열어 듣기 연습을 계속하세요.
pt_br: Abra Castlingo e continue seu treino auditivo
zh_hant: 打開 Castlingo，繼續你的聽力訓練

source: 打开系统设置
en: Open System Settings
es: Abrir configuraciones del sistema
ja: システム設定を開く
ko: 시스템 설정 열기
pt_br: Abrir configurações do sistema
zh_hant: 打開系統設定

source: 把这句话拼出来：
en: Build This Sentence:
es: Ordena la frase:
ja: この文を並べてください：
ko: 이 문장을 완성하세요:
pt_br: Monte esta frase:
zh_hant: 把這句話拼出來：

source: 抖音
en: TikTok
es: Douyin
ja: TikTok
ko: 틱톡
pt_br: TikTok

source: 按
en: Based on
es: según
ja: タップ
ko: 따라
pt_br: por

source: 掌握句型
en: Mastered Patterns
es: Patrones dominados
ja: 文型を習得
ko: 문형 마스터
pt_br: Padrões dominados

source: 掌握词汇
en: Mastered Vocabulary
es: Palabras dominadas
ja: 語彙を習得
ko: 어휘 마스터
pt_br: Palavras dominadas
zh_hant: 掌握單字

source: 探索
en: Explore
es: Explorar
ja: 探す
ko: 탐색
pt_br: Explorar

source: 探索内容生成中
en: Exploring Content
es: Explorando contenido
ja: コンテンツ生成中
ko: 콘텐츠 탐색 중
pt_br: Explorando conteúdo
zh_hant: 探索內容生成中

source: 推荐
en: Recommended
es: Recomendado
ja: おすすめ
ko: 추천
pt_br: Recomendado
zh_hant: 推薦

source: 提升自己
en: Self Improvement
es: Mejorar
ja: 自己啓発
ko: 자기 발전
pt_br: Auto melhoria

source: 搜索
en: Search
es: Buscar
ja: 検索
ko: 검색
pt_br: Buscar
zh_hant: 搜尋

source: 搜索每日播客 / 句型
en: Search Daily Podcasts / Patterns
es: Buscar pódcast / patrón diario
ja: ポッドキャスト／文型検索
ko: 매일 팟캐스트 / 문형 검색
pt_br: Buscar podcasts diários / padrão
zh_hant: 搜尋每日 Podcast / 句型

source: 搜索演讲 / 访谈
en: Search Speeches / Interviews
es: Buscar discurso / entrevista
ja: スピーチ／インタビュー検索
ko: 연설 / 인터뷰 검색
pt_br: Buscar palestras / entrevistas
zh_hant: 搜尋演講 / 訪談

source: 搜索演讲者 / 标题
en: Search Speaker / Title
es: Buscar orador / título
ja: スピーカー / タイトル検索
ko: 발표자 / 제목 검색
pt_br: Buscar autor / título
zh_hant: 搜尋演講者 / 標題

source: 搜索话题...
en: Search Topics...
es: Buscar tema...
ja: トピックを検索...
ko: 주제 검색...
pt_br: Pesquisar tópico...
zh_hant: 搜索話題...

source: 播客
en: Podcast
es: Pódcast
ja: ポッドキャスト
ko: 팟캐스트
pt_br: Podcast
zh_hant: Podcast

source: 播客集数不限 · 完整5遍
en: Unlimited Podcast · Complete 5 Rounds
es: Pódcast ilimitados · 5 rondas completas
ja: ポッドキャスト制限なし · 完全5回
ko: 팟캐스트 무제한 · 5회차 완료
pt_br: Podcasts ilimitados · 5 vezes completas
zh_hant: Podcast集數不限 · 完整5遍

source: 播放句型
en: Play Pattern
es: Reproducir patrón
ja: 文型再生
ko: 문형 재생
pt_br: Tocar padrão

source: 播放完成
en: Playback Complete
es: Reproducción completa
ja: 再生完了
ko: 재생 완료
pt_br: Reprodução concluída

source: 收藏
en: Favorite
es: Favoritos
ja: コレクション
ko: 즐겨찾기
pt_br: Favoritos

source: 新加坡
en: Singapore
es: Singapur
ja: シンガポール
ko: 싱가포르
pt_br: Cingapura

source: 新句
en: New Sentence
es: Nuevas
ja: 新しい文
ko: 새 문장
pt_br: Novas

source: 新手听众
en: Beginner Listener
es: Oyente principiante
ja: 初心者リスナー
ko: 초급 청취자
pt_br: Ouvinte iniciante
zh_hant: 新手聽眾

source: 新西兰
en: New Zealand
es: Nueva Zelanda
ja: ニュージーランド
ko: 뉴질랜드
pt_br: Nova Zelândia
zh_hant: 紐西蘭

source: 新词
en: New
es: Nuevas
ja: 新しい単語
ko: 새 단어
pt_br: Novas
zh_hant: 新單字

source: 新闻、商务，自然语速
en: News, Business, Natural Speed
es: Noticias, negocios, velocidad normal
ja: ニュース・ビジネス、自然な速度
ko: 뉴스, 비즈니스, 자연 속도
pt_br: Notícias, negócios, fala natural
zh_hant: 新聞、商務，自然語速

source: 旅行常用场景对话不慌不忙，点单问路都能自己来
en: Handle Travel Dialogues With Ease, Order & Ask Directions Yourself
es: Maneja diálogos de viaje sin prisa, pide y pregunta direcciones por tu cuenta
ja: 旅行のシーンで慌てず、注文や道案内も自分でできる
ko: 여행 상황에서 당황하지 않고 주문·길찾기 가능
pt_br: Cenas de viagem sem pressa, pedir ou perguntar direções por conta própria
zh_hant: 旅行常用場景對話不慌不忙，點單問路都能自己來

source: 无限制 · 自然语速 · 8-12分钟
en: No Limits · Natural Speed · 8-12 Min
es: Sin límite · Velocidad normal · 8-12 minutos
ja: 制限なし · 自然速 · 8〜12分
ko: 제한 없음 · 자연 속도 · 8-12분
pt_br: Sem limites · Velocidade natural · 8-12 min
zh_hant: 無限制 · 自然語速 · 8-12分鐘

source: 日常对话不用暂停回放也能跟上大意，敢在真实场景里开口回应
en: Follow Casual Chats Without Pausing, Speak Up in Real Situations
es: Charlas diarias sin pausa ni repetición, listo para hablar en escena real
ja: 日常会話は一時停止や再生なしでも概略を理解し、実際のシーンで話せる
ko: 일상 대화를 중단 없이 대강 따라가고, 실제 상황에서 대답 가능
pt_br: Conversas diárias sem precisar pausar, responda em cenas reais
zh_hant: 日常對話不用暫停回放也能跟上大意，敢在真實場景裡開口回應

source: 日常社交
en: Social
es: Social diario
ja: 日常の社交
ko: 일상 소셜
pt_br: Social diário

source: 日常词汇
en: Daily Vocabulary
es: Palabras diarias
ja: 日常語彙
ko: 일상 어휘
pt_br: Palavras do dia a dia
zh_hant: 日常詞彙

source: 日常词汇即将上线
en: Daily Vocabulary Coming Soon
es: Vocabulario diario pronto disponible
ja: 日常語彙が近日公開
ko: 일상 어휘 곧 출시
pt_br: Vocabulário diário em breve
zh_hant: 日常單字即將上線

source: 明天新内容上线时提醒你？
en: Remind You When New Content Arrives Tomorrow?
es: ¿Te avisamos del nuevo contenido mañana?
ja: 明日、新内容をお知らせしましょうか？
ko: 내일 새 내용 알림 받을까요?
pt_br: Lembrar você quando o novo conteúdo estiver disponível amanhã?
zh_hant: 明天新內容上線時提醒你？

source: 昨天
en: Yesterday
es: Ayer
ja: 昨日
ko: 어제
pt_br: Ontem

source: 暂不
en: Not Now
es: No ahora
ja: いいえ
ko: 보류
pt_br: Agora não
zh_hant: 暫不

source: 暂无往期内容
en: No Past Content
es: No hay contenido anterior
ja: 過去のコンテンツなし
ko: 이전 내용 없음
pt_br: Sem conteúdo anterior
zh_hant: 暫無往期內容

source: 暂无往期句型
en: No Past Patterns
es: No hay patrones anteriores
ja: 過去の文型はありません
ko: 지난 문형 없음
pt_br: Sem padrões anteriores
zh_hant: 暫無往期句型

source: 暂无词汇
en: No Words
es: No hay palabras
ja: 語彙がありません
ko: 단어 없음
pt_br: Sem palavras
zh_hant: 暫無單字

source: 暂时无法购买，请稍后重试。
en: Purchase unavailable. Please try again later.
es: Compra no disponible, intenta más tarde.
ja: 購入できません。後ほど再試行してください。
ko: 구매 불가. 잠시 후 다시 시도하세요.
pt_br: Compra temporariamente indisponível, tente novamente mais tarde.
zh_hant: 暫時無法購買，請稍後重試。

source: 更多表达
en: More Expressions
es: Más expresiones
ja: もっと表現
ko: 더 많은 표현
pt_br: Mais expressões
zh_hant: 更多表達

source: 更早
en: Earlier
es: Más temprano
ja: もっと前
ko: 이전
pt_br: Anterior

source: 最后一个问题
en: Final Question
es: Última pregunta
ja: 最後の質問
ko: 마지막 질문
pt_br: Última pergunta
zh_hant: 最後一個問題

source: 月
en: Month
es: mes
ko: 월
pt_br: meses

source: 月付
en: Monthly Payment
es: Pago mensual
ja: 月額
ko: 월 결제
pt_br: Mensal

source: 朋友推荐
en: Friend Referral
es: Recomendación de amigos
ja: 友達の推薦
ko: 친구 추천
pt_br: Recomendação de amigos
zh_hant: 朋友推薦

source: 本周
en: This Week
es: Esta semana
ja: 今週
ko: 이번 주
pt_br: Esta semana
zh_hant: 本週

source: 本周精选
en: Weekly Picks
es: Selecciones de la semana
ja: 今週のおすすめ
ko: 이번 주 추천
pt_br: Destaques da semana
zh_hant: 本週精選

source: 本周进度
en: This Week's Progress
es: Avance semanal
ja: 今週の進捗
ko: 이번 주 진도
pt_br: Progresso semanal
zh_hant: 本週進度

source: 本月
en: This Month
es: Este mes
ja: 今月
ko: 이번 달
pt_br: Este mês

source: 本期延伸学习
en: Extended Learning This Episode
es: Aprendizaje extendido
ja: 今号の拡張学習
ko: 이번 화 확장 학습
pt_br: Aprendizado estendido desta sessão
zh_hant: 本期延伸學習

source: 本次已练 %lld 词
en: Practiced %lld Words
es: %lld palabras practicadas
ja: %lld 単語練習済み
ko: %lld단어 연습함
pt_br: %lld palavras já praticadas
zh_hant: 本次已練 %lld 字

source: 本次累计已练 %lld 个词
en: Practiced %lld Words This Time
es: Has practicado %lld palabras
ja: 今回累計%lld個の単語を練習しました
ko: 이번에 %lld개 단어 연습 완료
pt_br: Total de %lld palavras praticadas
zh_hant: 本次累計已練 %lld 個詞

source: 本次累计已练 %lld 句
en: %lld Sentences Practiced This Time
es: %lld frases practicadas en total
ja: 今回 %lld 文を練習しました
ko: 이번에 %lld문장 연습 완료
pt_br: Neste total, já praticou %lld frases
zh_hant: 本次累計已練 %lld 句

source: 本组完成！
en: Set Complete!
es: ¡Grupo completo!
ja: このグループは完了！
ko: 이 그룹 완료!
pt_br: Grupo concluído!
zh_hant: 本組完成！

source: 本集完成！
en: Episode Complete!
es: ¡Episodio completado!
ja: 今回の内容が完了！
ko: 이번 화 완료!
pt_br: Cena completa!

source: 本集重点生词
en: Key Words This Episode
es: Palabras clave del episodio
ja: 今回の重要単語
ko: 이번 화의 주요 단어
pt_br: Palavras principais desta cena
zh_hant: 本集重點生字

source: 机场、酒店、餐厅，旅行场景课优先安排
en: Airport, Hotel, Restaurant - Priority Travel Scene Lessons
es: Aeropuerto, hotel, restaurante, clases de viaje prioritarias
ja: 空港、ホテル、レストラン、旅行シーンの講座優先
ko: 공항·호텔·레스토랑, 여행 상황 수업 우선
pt_br: Aeroporto, hotel, restaurante, aulas de viagem em prioridade
zh_hant: 機場、酒店、餐廳，旅行場景課優先安排

source: 来自：%@
en: From: %@
es: De: %@
ja: %@から
ko: 출처: %@
pt_br: De: %@
zh_hant: 來自：%@

source: 查看全部
en: View All
es: Ver todo
ja: すべて見る
ko: 모두 보기
pt_br: Ver tudo

source: 查看往期句型回顾
en: View Past Pattern Review
es: Ver revisión de patrones anteriores
ja: 過去の文型回顧を見る
ko: 이전 문형 회고 보기
pt_br: Ver revisão de padrões anteriores
zh_hant: 查看往期句型回顧

source: 查看更多
en: See More
es: Ver más
ja: もっと見る
ko: 더보기
pt_br: Ver mais

source: 查词中…
en: Searching Words…
es: Buscando…
ja: 単語検索中…
ko: 단어 검색 중…
pt_br: Pesquisando palavras...
zh_hant: 查詞中…

source: 查词失败，请稍后重试
en: Word Search Failed, Please Try Again Later
es: Error al buscar, intenta más tarde
ja: 単語検索失敗。しばらくしてから再試行してください
ko: 단어 검색 실패, 잠시 후 다시 시도하세요
pt_br: Falha na pesquisa, tente novamente mais tarde
zh_hant: 查詞失敗，請稍後重試
